---
layout: post
title: VLAN -2-
subtitle:  VLAN 실습
gh-repo: nohtaeyoung/nohtaeyoung.github.io
gh-badge: [star, fork, follow]
cover-img: /assets/img/security.jpg
tags: [Network]
comments: true
---

{: .box-note} 
이 블로그의 실습 프로그램은 Packet tracer을 사용합니다.

<h1>실습 1</h1>
## 구성도

![vlan2-1-](../assets/img/vlan2-1-.png)

## VLAN 정보 확인

{: .box-note} 
Switch#sh vlan brief <br>
<br>
<br>
VLAN Name                             Status    Ports<br>
---- -------------------------------- --------- -------------------------------<br>
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4<br>
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8<br>
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12<br>
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16<br>
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20<br>
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24<br>
                                                Gig0/1, Gig0/2<br>
                                                

## VLAN 생성 

{: .box-note} 
Switch(config)#vlan 10<br>
Switch(config-vlan)#exit<br>
Switch(config)#vlan 20<br>
Switch(config-vlan)#exit<br>
Switch#sh vlan brief<br>
~<br>
10   VLAN0010                         active<br>
20   VLAN0020                         active<br>

## switchport 에서 VLAN 을 지정 

{: .box-note} 
Switch(config)#int f0/1<br>
Switch(config-if)#switchport mode access <br>
Switch(config-if)#switchport access vlan 10<br>
<br>
Switch(config-if)#int f0/2<br>
Switch(config-if)#switchport mode access <br>
Switch(config-if)#switchport access vlan 20<br>

## VLAN 정보 확인

{: .box-note} 
Switch#sh vlan brief <br>
VLAN Name                             Status    Ports<br>
---- -------------------------------- --------- ------------------------------<br>
~<br>
10   VLAN0010                         active    Fa0/1<br>
20   VLAN0020                         active    Fa0/2<br>

## 나머지 switchport 에서 VLAN 을 지정 그리고 정보 확인까지

{: .box-note} 
Switch(config)#int f0/11<br>
Switch(config-if)#switchport mode access <br>
Switch(config-if)#switchport access vlan 10<br>
<br>
Switch(config-if)#int f0/12<br>
Switch(config-if)#switchport mode access <br>
Switch(config-if)#switchport access vlan 20<br>
<br>
Switch#sh vlan brief <br>
VLAN Name                             Status    Ports<br>
---- -------------------------------- --------- -------------------------------<br>
~<br>
10   VLAN0010                         active    Fa0/1, Fa0/11<br>
20   VLAN0020                         active    Fa0/2, Fa0/12<br>

<h1>실습 2</h1>

{: .box-note} 
실습 1의 구성도를 활용해 Trunk mode를 해주기
  
## 구성도
  
![vlan2-2-](../assets/img/vlan2-2-.png)

## 새로 만든 switch도 vlan 설정 그리고 양쪽 스위치 연결
  
{: .box-note} 
Switch(config)#int f0/22<br>
Switch(config-if)#switchport mode ?<br>
  access   Set trunking mode to ACCESS unconditionally<br>
  dynamic  Set trunking mode to dynamically negotiate access or trunk mode<br>
  trunk    Set trunking mode to TRUNK unconditionally<br>
<br>
SW_L(config)#int f0/22<br>
SW_L(config-if)#switchport mode access <br>
SW_L(config-if)#switchport access vlan ?<br>
  <1-4094>  VLAN ID of the VLAN when this port is in access mode<br>
SW_L(config-if)#switchport access vlan 10<br>
<br>
SW_R(config)#int f0/22<br>
SW_R(config-if)#switchport mode access <br>
SW_R(config-if)#switchport access vlan 10<br>
% Access VLAN does not exist. Creating vlan 10<br>
<br>
SW_R(config-if)#int f0/1<br>
SW_R(config-if)#switchport mode access <br>
SW_R(config-if)#switchport access vlan 10<br>
<br>
SW_L(config)#int f0/23<br>
SW_L(config-if)#switchport mode access <br>
SW_L(config-if)#switchport access vlan ?<br>
  <1-4094>  VLAN ID of the VLAN when this port is in access mode<br>
SW_L(config-if)#switchport access vlan 20<br>
<br>
SW_R(config)#int f0/23<br>
SW_R(config-if)#switchport mode access <br>
SW_R(config-if)#switchport access vlan 20<br>
% Access VLAN does not exist. Creating vlan 20<br>
<br>
SW_R(config-if)#int f0/2<br>
SW_R(config-if)#switchport mode access <br>
SW_R(config-if)#switchport access vlan 20<br><br>
<br>
하지만 이렇게 양쪽 switch를 통신하려면 많은 연결이 필요하니<br>
Trunk라는 것으로 한개만 연결하여 여러개의 Vlan frame을 보낼 수 있도록 설정하겠다.
    
## trunk 설정
   
{: .box-note} 
- 왼쪽 스위치 <br>
SW_L(config-if)#switchport mode ?<br>
  access   Set trunking mode to ACCESS unconditionally<br>
  dynamic  Set trunking mode to dynamically negotiate access or trunk mode<br>
  trunk    Set trunking mode to TRUNK unconditionally<br>
SW_L(config-if)#switchport mode trunk <br>
<br>
SW_L(config-if)#switchport trunk allowed ?<br>
  vlan  Set allowed VLANs when interface is in trunking mode<br>
SW_L(config-if)#switchport trunk allowed vlan ?<br>
  WORD    VLAN IDs of the allowed VLANs when this port is in trunking mode<br>
  add     add VLANs to the current list<br>
  all     all VLANs<br>
  except  all VLANs except the following<br>
  none    no VLANs<br>
  remove  remove VLANs from the current list<br>
SW_L(config-if)#switchport trunk allowed vlan 10,20<br>
<br>
- 오른쪽 스위치<br>
SW_R(config)#int f0/24<br>
SW_R(config-if)#switchport mode trunk<br>
SW_R(config-if)#switchport trunk allowed vlan 10,20<br>
