---
layout: post
title: Static Routing -1-
subtitle:  RIP
gh-repo: nohtaeyoung/nohtaeyoung.github.io
gh-badge: [star, fork, follow]
cover-img: /assets/img/security.jpg
tags: [OSI 7Layer,router,rip,static, GitHub, infosec_oh_nohoooooo_tae_young, taeyoung noh]
comments: true
---


## RIM (Routing Information Protocol)
 - 동일한 Protocol을 사용하는 인접 장비와 <b style="color:red"> Connected Network 정보를 교환 /b> 함
  - Multicast Group -> 224.0.0.9
 - <b style="color:red">최단 거리(Hop Count)기준으로 경로를 선택</b>
  - Hop Count를 Metric 값으로 사용
 - Version 1
  - Classful Routing -> <b>네트워크주소</b>dhk <b>Hop count</b>를 전달 함
 - Version 2
  - Classless Routing -> <b>네트워크주소</b>와 <b>서브넷 마스크</b>와 <b>Hop Count</를 함께 전달 함
 - 비교적 작은 범위의 네트워크에서 샤용함
  -  <b style="color:red">hop count Limit -> 16</b>
 - 30초 주기로 경로 정보를 교환하기 때문에 변화가 적용되는 속도(Convergence Time)가 느림
 - 경로 계산 알고리즘 -> Bellman-Ford(B-F) Algorithm
 - 네트워크 정보를 학습한 인터페이스 방향으로 동일한 네트워크 정보를 재 전달하지 않음 -> Split Horizon
  
## RIP v2 동작 방식
- RIPv2가 설정되면 자시느이 Routing Table에 있는 Connected 정보를 광고 함
  - Multicast(224.0.0.9) 전달
- 광고 메시지를 받은 장비는 자신의 Routing Table에 없는 정보를 기록
  - 데이터가 들어온 Interface를 경로로 지정
  - 전달받은 Hop Count +1 값을 저장
- RIPv2가 설정된 모든 Router에서 일정 주기마다 Routing 정보를 광고하는 메시지를 전송

  
 ## RIP 실습
  <h3>구성도</h3>
  
  ![rip1](../assets/img/rip1.png)
  
  ### 모든 라우터에 PT-ROUTER-NM-1CFE를 추가 해준다.
  
  ![rip2](../assets/img/rip2.png)
  
  ### 각 PC에 주소를 넣어준다.
  
   ![rip3](../assets/img/rip3.png)
   ![rip4](../assets/img/rip4.png)
  
## RIP 설정  
  
```
  R1(config)#router ?
  bgp    Border Gateway Protocol (BGP)
  eigrp  Enhanced Interior Gateway Routing Protocol (EIGRP)
  ospf   Open Shortest Path First (OSPF)
  rip    Routing Information Protocol (RIP)

R1(config)#router rip
R1(config-router)#network 1.0.0.0
R1(config-router)#network 3.0.0.0
R1(config-router)#network 192.168.1.0

R2(config)#router rip 
R2(config-router)#network 1.0.0.0
R2(config-router)#network 2.0.0.0

R3(config)#router rip 
R3(config-router)#network 3.0.0.0
R3(config-router)#network 4.0.0.0

R5(config)#router rip 
R5(config-router)#network 5.0.0.0
R5(config-router)#network 4.0.0.0

R4(config)#router rip 
R4(config-router)#network 5.0.0.0
R4(config-router)#network 2.0.0.0
R4(config-router)#network 192.168.2.0
```

## RIP Version2로 변경
```
  R5#sh ip route 
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
R    1.0.0.0/8 [120/2] via 4.4.4.4, 00:00:10, FastEthernet0/0
               [120/2] via 5.5.5.6, 00:00:10, FastEthernet1/0
R    2.0.0.0/8 [120/1] via 5.5.5.6, 00:00:10, FastEthernet1/0
R    3.0.0.0/8 [120/1] via 4.4.4.4, 00:00:10, FastEthernet0/0
C    4.0.0.0/8 is directly connected, FastEthernet0/0
C    5.0.0.0/8 is directly connected, FastEthernet1/0
R    192.168.1.0/24 [120/2] via 4.4.4.4, 00:00:10, FastEthernet0/0
R    192.168.2.0/24 [120/1] via 5.5.5.6, 00:00:10, FastEthernet1/0

  
R1(config)#router rip 
R1(config-router)#version 2
R1(config-router)#no auto-summary

R2(config)#router rip 
R2(config-router)#version 2
R2(config-router)#no auto-summary

R4(config)#router rip 
R4(config-router)#version 2
R4(config-router)#no auto-summary

R5(config)#router rip 
R5(config-router)#version 2
R5(config-router)#no auto-summary

R3(config)#router rip
R3(config-router)#version 2
R3(config-router)#no auto-summary
```  
  
## 인터페이스로 광고하는 것을 막는다.
```
  R1(config)#router rip
R1(config-router)#passive-interface ?
  Ethernet         IEEE 802.3
  FastEthernet     FastEthernet IEEE 802.3
  GigabitEthernet  GigabitEthernet IEEE 802.3z
  Loopback         Loopback interface
  Serial           Serial
  default          Suppress routing updates on all interfaces
R1(config-router)#passive-interface fastEthernet 2/0

R4(config)#router rip 
R4(config-router)#passive-interface fastEthernet 2/0

```
  


